; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v12)
             (pred_1 ?v5 ?v9)
             (pred_11 ?v10 ?v9)
             (pred_3 ?v6 ?v10 )
	     (pred_12 ?v10)
             (pred_6 ?v4)
             (pred_4 ?v5)
             (pred_10 ?v9)
             (pred_2 ?v10)
             (pred_8 ?v5)
             (pred_7 ?v10)
             (pred_5 ))



(:action op_4
:parameters (?v3 ?v13 ?v11 ?v2)
:precondition (and (pred_6 ?v3) (pred_6 ?v13) (pred_4 ?v11) (pred_10 ?v2)
          (pred_9 ?v3 ?v13) (pred_1 ?v11 ?v2)
                   (pred_11 ?v13 ?v2) (pred_12 ?v3) 
                   (pred_2 ?v13) (pred_8 ?v11))
:effect (and  (pred_7 ?v13) (not (pred_2 ?v13))))


(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_6 ?v3) (pred_6 ?v7)
               (pred_12 ?v3) (pred_9 ?v3 ?v7) (pred_7 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v3))))

(:action op_3
:parameters (?v3 ?v11)
:precondition (and (pred_6 ?v3) (pred_4 ?v11) 
                  (pred_12 ?v3) (pred_3 ?v11 ?v3) (pred_5 ))
:effect (and (pred_8 ?v11)
   (not (pred_3 ?v11 ?v3)) (not (pred_5 ))))


(:action op_5
:parameters (?v3 ?v8 ?v1)
:precondition (and (pred_6 ?v3) (pred_4 ?v8) (pred_4 ?v1)
                  (pred_12 ?v3) (pred_8 ?v1) (pred_3 ?v8 ?v3))
:effect (and (pred_8 ?v8) (pred_3 ?v1 ?v3)
        (not (pred_8 ?v1)) (not (pred_3 ?v8 ?v3))))

(:action op_1
:parameters (?v3 ?v11)
:precondition (and (pred_6 ?v3) (pred_4 ?v11) 
                  (pred_12 ?v3) (pred_8 ?v11))
:effect (and (pred_5 ) (pred_3 ?v11 ?v3) (not (pred_8 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_23 obj_11 obj_01 obj_05 obj_26 obj_15 obj_21 obj_12 obj_22 obj_19 obj_04 obj_25 obj_14 obj_31 obj_29 obj_09 obj_03 obj_20 obj_06 obj_27 obj_17 obj_10 obj_16 obj_30
    obj_24 obj_07 obj_02
    obj_08 obj_13 obj_18
    )

    (:init
       (pred_5)

       (pred_6 obj_28)
       (pred_6 obj_23)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_05)
       (pred_6 obj_26)
       (pred_6 obj_15)
       (pred_6 obj_21)
       (pred_6 obj_12)
       (pred_6 obj_22)
       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_14)
       (pred_6 obj_31)
       (pred_6 obj_29)
       (pred_6 obj_09)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_06)
       (pred_6 obj_27)
       (pred_6 obj_17)
       (pred_6 obj_10)
       (pred_6 obj_16)
       (pred_6 obj_30)
       (pred_10 obj_24)
       (pred_10 obj_07)
       (pred_10 obj_02)
       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_18)

       (pred_9 obj_28 obj_26)
       (pred_9 obj_28 obj_23)
       (pred_9 obj_23 obj_15)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_23 obj_28)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_05 obj_22)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_26 obj_15)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_15 obj_23)
       (pred_9 obj_15 obj_26)
       (pred_9 obj_21 obj_25)
       (pred_9 obj_21 obj_12)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_12 obj_22)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_21)
       (pred_9 obj_22 obj_31)
       (pred_9 obj_22 obj_05)
       (pred_9 obj_22 obj_12)
       (pred_9 obj_19 obj_29)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_04 obj_25)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_25 obj_14)
       (pred_9 obj_25 obj_21)
       (pred_9 obj_25 obj_04)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_31)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_25)
       (pred_9 obj_31 obj_06)
       (pred_9 obj_31 obj_22)
       (pred_9 obj_31 obj_14)
       (pred_9 obj_29 obj_27)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_29 obj_19)
       (pred_9 obj_09 obj_17)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_03 obj_10)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_06 obj_30)
       (pred_9 obj_06 obj_31)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_27 obj_29)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_09)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_10 obj_16)
       (pred_9 obj_10 obj_03)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_10)
       (pred_9 obj_30 obj_06)
       (pred_9 obj_30 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_04)
       (pred_2 obj_25)
       (pred_11  obj_21 obj_24)
       (pred_11  obj_04 obj_07)
       (pred_11  obj_25 obj_02)
       (pred_7 obj_28)
       (pred_7 obj_23)
       (pred_7 obj_11)
       (pred_7 obj_01)
       (pred_7 obj_05)
       (pred_7 obj_26)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_7 obj_22)
       (pred_7 obj_19)
       (pred_7 obj_14)
       (pred_7 obj_31)
       (pred_7 obj_29)
       (pred_7 obj_09)
       (pred_7 obj_03)
       (pred_7 obj_20)
       (pred_7 obj_06)
       (pred_7 obj_27)
       (pred_7 obj_17)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_30)

       (pred_1  obj_08 obj_24)
       (pred_1  obj_13 obj_07)
       (pred_1  obj_18 obj_02)
       (pred_3 obj_08 obj_28)
       (pred_3 obj_13 obj_05)
       (pred_3 obj_18 obj_20)
       (pred_12 obj_06)
    )

    (:goal (and
       (pred_3 obj_08 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_01)))
)
)

; plan
1. (op_2 obj_06 obj_20)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_20)
   goals met: 0 of 1
2. (op_2 obj_20 obj_03)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_03)
   goals met: 0 of 1
3. (op_2 obj_03 obj_09)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_09)
   goals met: 0 of 1
4. (op_2 obj_09 obj_29)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_29)
   goals met: 0 of 1
5. (op_2 obj_29 obj_19)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_19)
   goals met: 0 of 1
6. (op_2 obj_19 obj_26)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_26)
   goals met: 0 of 1
7. (op_2 obj_26 obj_28)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_28)
   goals met: 0 of 1
8. (op_3 obj_28 obj_08)
   deleted: (pred_3 obj_08 obj_28) (pred_5)
   added: (pred_8 obj_08)
   goals met: 0 of 1
9. (op_2 obj_28 obj_23)
   deleted: (pred_12 obj_28)
   added: (pred_12 obj_23)
   goals met: 0 of 1
10. (op_2 obj_23 obj_11)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_11)
   goals met: 0 of 1
11. (op_4 obj_11 obj_21 obj_08 obj_24)
   deleted: (pred_2 obj_21)
   added: (pred_7 obj_21)
   goals met: 0 of 1
12. (op_2 obj_11 obj_21)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_21)
   goals met: 0 of 1
13. (op_2 obj_21 obj_12)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_12)
   goals met: 0 of 1
14. (op_2 obj_12 obj_22)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_22)
   goals met: 0 of 1
15. (op_2 obj_22 obj_05)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_05)
   goals met: 0 of 1
16. (op_5 obj_05 obj_13 obj_08)
   deleted: (pred_8 obj_08) (pred_3 obj_13 obj_05)
   added: (pred_8 obj_13) (pred_3 obj_08 obj_05)
   goals met: 1 of 1
